---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenSelfIntersection
source: html/18d25bd3-f79f-4093-5450-c26ed8e7d73b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenSelfIntersection Property

Unable to create form element: self-intersecting or singular geometry would result.

## Syntax (C#)
```csharp
public static FailureDefinitionId FormElemRegenSelfIntersection { get; }
```